In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'Age':[19,20,24,19,20],
         'Marks':[99, 90, 70, 64, 90]}
df=pd.DataFrame(data)

In [3]:
df

   Age  Marks
0   19     99
1   20     90
2   24     70
3   19     64
4   20     90

In [4]:
df[df.duplicated()]

   Age  Marks
4   20     90

In [5]:
df.drop_duplicates(keep='first')

   Age  Marks
0   19     99
1   20     90
2   24     70
3   19     64

In [8]:
df.drop_duplicates(keep=False)

   Age  Marks
0   19     99
2   24     70
3   19     64

In [10]:
df.drop_duplicates('Marks')

   Age  Marks
0   19     99
1   20     90
2   24     70
3   19     64

In [11]:
df.drop_duplicates().sum()

Age       82
Marks    323
dtype: int64

In [12]:
df["Age"].unique()

array([19, 20, 24])